## Production: secrets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                         NAME                          |
|----------|-------------------------------------------------------|
| recreate | `aws_secretsmanager_secret_version.freshdesk_api_key` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_secretsmanager_secret_version.freshdesk_api_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "freshdesk_api_key" {
      ~ arn                  = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:freshdesk_api_key-2Q118n" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:freshdesk_api_key-2Q118n|050422F2-B95D-45CF-83EC-7F5D7B1A59A2" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "050422F2-B95D-45CF-83EC-7F5D7B1A59A2" -> (known after apply)
      ~ version_stages       = [
          - "AWSPREVIOUS",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.freshdesk_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.hcaptcha_site_verify_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.notify_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.notify_callback_bearer_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.recaptcha_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.sentry_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.token_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.zitadel_administration_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.zitadel_application_key"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
